CupoMeridio/I-miei-progetti-STM32/LED_MultiTask_Hardware_Timers/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Led_green_Pin GPIO_PIN_0
#define Led_green_GPIO_Port GPIOA
#define Led_yellow_Pin GPIO_PIN_1
#define Led_yellow_GPIO_Port GPIOA
#define Led_red_Pin GPIO_PIN_4
#define Led_red_GPIO_Port GPIOA
#define Led_blu_Pin GPIO_PIN_7
#define Led_blu_GPIO_Port GPIOA
#define Button_on_Pin GPIO_PIN_0
#define Button_on_GPIO_Port GPIOB
#define Button_on_EXTI_IRQn EXTI0_IRQn
#define Button_red_Pin GPIO_PIN_1
#define Button_red_GPIO_Port GPIOB
#define Button_red_EXTI_IRQn EXTI1_IRQn
#define Button_speed_down_Pin GPIO_PIN_10
#define Button_speed_down_GPIO_Port GPIOB
#define Button_speed_down_EXTI_IRQn EXTI15_10_IRQn
#define Button_queue_execute_Pin GPIO_PIN_9
#define Button_queue_execute_GPIO_Port GPIOA
#define Button_queue_execute_EXTI_IRQn EXTI9_5_IRQn
#define Button_yellow_Pin GPIO_PIN_3
#define Button_yellow_GPIO_Port GPIOB
#define Button_yellow_EXTI_IRQn EXTI3_IRQn
#define Button_speed_up_Pin GPIO_PIN_4
#define Button_speed_up_GPIO_Port GPIOB
#define Button_speed_up_EXTI_IRQn EXTI4_IRQn
#define Button_off_Pin GPIO_PIN_5
#define Button_off_GPIO_Port GPIOB
#define Button_off_EXTI_IRQn EXTI9_5_IRQn
#define Button_green_Pin GPIO_PIN_6
#define Button_green_GPIO_Port GPIOB
#define Button_green_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */
#define QUEUE_CAPACITY 10

typedef enum {
	LED_NONE   = 0,
	LED_RED    = 1,
	LED_YELLOW = 2,
	LED_GREEN  = 3
} led_id_t;
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
